# FaceArray Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceArray Class
Members See Also
---
An array that contains faces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FaceArray : APIObject, IEnumerable
```

Visual Basic
---
```text
Public Class FaceArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class FaceArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FaceArray
# See Also
FaceArray Members
Autodesk.Revit.DB Namespace